# GroupBy Function

In [3]:
import pandas as pd

var = pd.DataFrame({
    "name":["a","b","b","c","a","c","c","b","a","a"],
    "s_1": [12,13,10,14,12,23,18,15,11,15],
    "s_2": [13,10,14,12,13,10,18,15,11,15]
})

var

  name  s_1  s_2
0    a   12   13
1    b   13   10
2    b   10   14
3    c   14   12
4    a   12   13
5    c   23   10
6    c   18   18
7    b   15   15
8    a   11   11
9    a   15   15

In [4]:
var_new = var.groupby("name")

var_new #its gruopped but to show it, we need to use loop

In [10]:
for x,y in var_new:
    print(x)
    print(y)  #what is y doing here????????????

a
  name  s_1  s_2
0    a   12   13
4    a   12   13
8    a   11   11
9    a   15   15
b
  name  s_1  s_2
1    b   13   10
2    b   10   14
7    b   15   15
c
  name  s_1  s_2
3    c   14   12
5    c   23   10
6    c   18   18

get_group function: to get data of individual group

In [11]:
var_new.get_group("a")

  name  s_1  s_2
0    a   12   13
4    a   12   13
8    a   11   11
9    a   15   15

In [12]:
var_new.min()

      s_1  s_2
name
a      11   11
b      10   10
c      14   10

In [13]:
var_new.max()

      s_1  s_2
name
a      15   15
b      15   15
c      23   18

Data Fram to list

In [15]:
li = list(var_new)

li

[('a',
    name  s_1  s_2
  0    a   12   13
  4    a   12   13
  8    a   11   11
  9    a   15   15),
 ('b',
    name  s_1  s_2
  1    b   13   10
  2    b   10   14
  7    b   15   15),
 ('c',
    name  s_1  s_2
  3    c   14   12
  5    c   23   10
  6    c   18   18)]